{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.5", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3], "name": "conv2d_1", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 32, "activation": "relu", "dtype": "float32", "batch_input_shape": [null, 64, 64, 3], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "kernel_size": [3, 3], "name": "conv2d_2", "bias_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 32, "padding": "valid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "units": 128, "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "name": "dense_2", "bias_regularizer": null, "units": 1, "activation": "sigmoid", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true}}]}